# Topic 8 Homework -- Bin Linsheng

In [1]:
import numpy as np
import pandas as pd

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01 -0.446169 -0.569144 -1.365333 -0.511584
2013-01-02  0.139317  1.584492 -0.068558  0.973980
2013-01-03 -1.789522  1.456769 -0.003612  0.033185
2013-01-04  0.101666  0.255572 -0.075658 -1.066311
2013-01-05  2.064892  1.147546 -0.242835  1.238422
2013-01-06  1.288499  1.349532  2.009279 -0.801083

In [5]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [6]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [10]:
df.head()

                   A         B         C         D
2013-01-01 -0.446169 -0.569144 -1.365333 -0.511584
2013-01-02  0.139317  1.584492 -0.068558  0.973980
2013-01-03 -1.789522  1.456769 -0.003612  0.033185
2013-01-04  0.101666  0.255572 -0.075658 -1.066311
2013-01-05  2.064892  1.147546 -0.242835  1.238422

In [11]:
df.tail(3)

                   A         B         C         D
2013-01-04  0.101666  0.255572 -0.075658 -1.066311
2013-01-05  2.064892  1.147546 -0.242835  1.238422
2013-01-06  1.288499  1.349532  2.009279 -0.801083

In [12]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [13]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [14]:
df.to_numpy()

array([[-0.44616917, -0.56914381, -1.36533278, -0.51158413],
       [ 0.1393165 ,  1.58449191, -0.06855764,  0.97398039],
       [-1.78952157,  1.45676877, -0.00361201,  0.0331845 ],
       [ 0.10166591,  0.25557234, -0.07565838, -1.066311  ],
       [ 2.06489181,  1.14754568, -0.24283536,  1.23842245],
       [ 1.28849871,  1.34953213,  2.00927888, -0.80108265]])

In [15]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [16]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [17]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.226447  0.870795  0.042214 -0.022232
std    1.345179  0.849757  1.091792  0.950887
min   -1.789522 -0.569144 -1.365333 -1.066311
25%   -0.309210  0.478566 -0.201041 -0.728708
50%    0.120491  1.248539 -0.072108 -0.239200
75%    1.001203  1.429960 -0.019848  0.738781
max    2.064892  1.584492  2.009279  1.238422

In [18]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.446169    0.139317   -1.789522    0.101666    2.064892    1.288499
B   -0.569144    1.584492    1.456769    0.255572    1.147546    1.349532
C   -1.365333   -0.068558   -0.003612   -0.075658   -0.242835    2.009279
D   -0.511584    0.973980    0.033185   -1.066311    1.238422   -0.801083

In [19]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.511584 -1.365333 -0.569144 -0.446169
2013-01-02  0.973980 -0.068558  1.584492  0.139317
2013-01-03  0.033185 -0.003612  1.456769 -1.789522
2013-01-04 -1.066311 -0.075658  0.255572  0.101666
2013-01-05  1.238422 -0.242835  1.147546  2.064892
2013-01-06 -0.801083  2.009279  1.349532  1.288499

In [20]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-01 -0.446169 -0.569144 -1.365333 -0.511584
2013-01-04  0.101666  0.255572 -0.075658 -1.066311
2013-01-05  2.064892  1.147546 -0.242835  1.238422
2013-01-06  1.288499  1.349532  2.009279 -0.801083
2013-01-03 -1.789522  1.456769 -0.003612  0.033185
2013-01-02  0.139317  1.584492 -0.068558  0.973980

In [21]:
df["A"]

2013-01-01   -0.446169
2013-01-02    0.139317
2013-01-03   -1.789522
2013-01-04    0.101666
2013-01-05    2.064892
2013-01-06    1.288499
Freq: D, Name: A, dtype: float64

In [22]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.446169 -0.569144 -1.365333 -0.511584
2013-01-02  0.139317  1.584492 -0.068558  0.973980
2013-01-03 -1.789522  1.456769 -0.003612  0.033185

In [23]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02  0.139317  1.584492 -0.068558  0.973980
2013-01-03 -1.789522  1.456769 -0.003612  0.033185
2013-01-04  0.101666  0.255572 -0.075658 -1.066311

In [24]:
df.loc[dates[0]]

A   -0.446169
B   -0.569144
C   -1.365333
D   -0.511584
Name: 2013-01-01 00:00:00, dtype: float64

In [25]:
df.loc[:, ["A", "B"]]

                   A         B
2013-01-01 -0.446169 -0.569144
2013-01-02  0.139317  1.584492
2013-01-03 -1.789522  1.456769
2013-01-04  0.101666  0.255572
2013-01-05  2.064892  1.147546
2013-01-06  1.288499  1.349532

In [26]:
df.loc["20130102":"20130104", ["A", "B"]]

                   A         B
2013-01-02  0.139317  1.584492
2013-01-03 -1.789522  1.456769
2013-01-04  0.101666  0.255572

In [27]:
df.loc[dates[0], "A"]

-0.4461691699424358

In [28]:
df.at[dates[0], "A"]

-0.4461691699424358

In [29]:
df.iloc[3]

A    0.101666
B    0.255572
C   -0.075658
D   -1.066311
Name: 2013-01-04 00:00:00, dtype: float64

In [30]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04  0.101666  0.255572
2013-01-05  2.064892  1.147546

In [31]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02  0.139317 -0.068558
2013-01-03 -1.789522 -0.003612
2013-01-05  2.064892 -0.242835

In [32]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02  0.139317  1.584492 -0.068558  0.973980
2013-01-03 -1.789522  1.456769 -0.003612  0.033185

In [33]:
df.iloc[:, 1:3]

                   B         C
2013-01-01 -0.569144 -1.365333
2013-01-02  1.584492 -0.068558
2013-01-03  1.456769 -0.003612
2013-01-04  0.255572 -0.075658
2013-01-05  1.147546 -0.242835
2013-01-06  1.349532  2.009279

In [34]:
df.iloc[1, 1]

1.584491905713399

In [35]:
df.iat[1, 1]

1.584491905713399

In [36]:
df[df["A"] > 0]

                   A         B         C         D
2013-01-02  0.139317  1.584492 -0.068558  0.973980
2013-01-04  0.101666  0.255572 -0.075658 -1.066311
2013-01-05  2.064892  1.147546 -0.242835  1.238422
2013-01-06  1.288499  1.349532  2.009279 -0.801083

In [37]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN       NaN       NaN       NaN
2013-01-02  0.139317  1.584492       NaN  0.973980
2013-01-03       NaN  1.456769       NaN  0.033185
2013-01-04  0.101666  0.255572       NaN       NaN
2013-01-05  2.064892  1.147546       NaN  1.238422
2013-01-06  1.288499  1.349532  2.009279       NaN

In [38]:
df2 = df.copy()
df2["E"] = ["one", "one", "two", "three", "four", "three"]
df2

                   A         B         C         D      E
2013-01-01 -0.446169 -0.569144 -1.365333 -0.511584    one
2013-01-02  0.139317  1.584492 -0.068558  0.973980    one
2013-01-03 -1.789522  1.456769 -0.003612  0.033185    two
2013-01-04  0.101666  0.255572 -0.075658 -1.066311  three
2013-01-05  2.064892  1.147546 -0.242835  1.238422   four
2013-01-06  1.288499  1.349532  2.009279 -0.801083  three

In [39]:
df2[df2["E"].isin(["two", "four"])]

                   A         B         C         D     E
2013-01-03 -1.789522  1.456769 -0.003612  0.033185   two
2013-01-05  2.064892  1.147546 -0.242835  1.238422  four

In [40]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range("20130102", periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [42]:
df["F"] = s1
df.at[dates[0], "A"] = 0
df.iat[0, 1] = 0
df.loc[:, "D"] = np.array([5] * len(df))
df

                   A         B         C    D    F
2013-01-01  0.000000  0.000000 -1.365333  5.0  NaN
2013-01-02  0.139317  1.584492 -0.068558  5.0  1.0
2013-01-03 -1.789522  1.456769 -0.003612  5.0  2.0
2013-01-04  0.101666  0.255572 -0.075658  5.0  3.0
2013-01-05  2.064892  1.147546 -0.242835  5.0  4.0
2013-01-06  1.288499  1.349532  2.009279  5.0  5.0

In [43]:
df2 = df.copy()
df2[df2 > 0] = -df2
df2

                   A         B         C    D    F
2013-01-01  0.000000  0.000000 -1.365333 -5.0  NaN
2013-01-02 -0.139317 -1.584492 -0.068558 -5.0 -1.0
2013-01-03 -1.789522 -1.456769 -0.003612 -5.0 -2.0
2013-01-04 -0.101666 -0.255572 -0.075658 -5.0 -3.0
2013-01-05 -2.064892 -1.147546 -0.242835 -5.0 -4.0
2013-01-06 -1.288499 -1.349532 -2.009279 -5.0 -5.0

In [44]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ["E"])
df1.loc[dates[0] : dates[1], "E"] = 1
df1

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000 -1.365333  5.0  NaN  1.0
2013-01-02  0.139317  1.584492 -0.068558  5.0  1.0  1.0
2013-01-03 -1.789522  1.456769 -0.003612  5.0  2.0  NaN
2013-01-04  0.101666  0.255572 -0.075658  5.0  3.0  NaN

In [45]:
df1.dropna(how="any")

                   A         B         C    D    F    E
2013-01-02  0.139317  1.584492 -0.068558  5.0  1.0  1.0

In [46]:
df1.fillna(value=5)

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000 -1.365333  5.0  5.0  1.0
2013-01-02  0.139317  1.584492 -0.068558  5.0  1.0  1.0
2013-01-03 -1.789522  1.456769 -0.003612  5.0  2.0  5.0
2013-01-04  0.101666  0.255572 -0.075658  5.0  3.0  5.0

In [47]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

In [48]:
df.mean()

A    0.300809
B    0.965652
C    0.042214
D    5.000000
F    3.000000
dtype: float64

In [49]:
df.mean(axis=1)

2013-01-01    0.908667
2013-01-02    1.531050
2013-01-03    1.332727
2013-01-04    1.656316
2013-01-05    2.393920
2013-01-06    2.929462
Freq: D, dtype: float64

In [50]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [51]:
df.sub(s, axis="index")

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -2.789522  0.456769 -1.003612  4.0  1.0
2013-01-04 -2.898334 -2.744428 -3.075658  2.0  0.0
2013-01-05 -2.935108 -3.852454 -5.242835  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

In [52]:
df.agg(lambda x: np.mean(x) * 5.6)

A     1.684528
B     5.407650
C     0.236397
D    28.000000
F    16.800000
dtype: float64

In [53]:
df.transform(lambda x: x * 101.2)

                     A           B           C      D      F
2013-01-01    0.000000    0.000000 -138.171677  506.0    NaN
2013-01-02   14.098830  160.350581   -6.938033  506.0  101.2
2013-01-03 -181.099583  147.425000   -0.365535  506.0  202.4
2013-01-04   10.288590   25.863921   -7.656629  506.0  303.6
2013-01-05  208.967051  116.131622  -24.574938  506.0  404.8
2013-01-06  130.396070  136.572652  203.339023  506.0  506.0

In [54]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    3
1    2
2    5
3    4
4    5
5    6
6    2
7    3
8    1
9    2
dtype: int64

In [55]:
s.value_counts()

2    3
3    2
5    2
4    1
6    1
1    1
Name: count, dtype: int64

In [56]:
s = pd.Series(["A", "B", "C", "Aaba", "Baca", np.nan, "CABA", "dog", "cat"])
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object